client/results/rq2/h1/stresstest/client_2/summary.txt
starting benchmark...
spawning thread #0: 1 total client(s). 25000 total requests
spawning thread #1: 1 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 31.63s, 1580.60 req/s, 6.93MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      507us     10.83ms      1.19ms       428us    88.60%
time for connect:     7.68ms      9.67ms      8.67ms      1.40ms   100.00%
time to 1st byte:    11.16ms     15.67ms     13.42ms      3.19ms   100.00%
req/s           :     790.33      882.18      836.25       64.95   100.00%