client/results/rq2/h1/stresstest/client_2/summary.txt
starting benchmark...
spawning thread #0: 1 total client(s). 25000 total requests
spawning thread #1: 1 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 26.97s, 1853.67 req/s, 8.13MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      401us     28.15ms      1.07ms       462us    90.25%
time for connect:     5.68ms      8.24ms      6.96ms      1.81ms   100.00%
time to 1st byte:    10.83ms     12.44ms     11.63ms      1.14ms   100.00%
req/s           :     926.85      928.16      927.50        0.92   100.00%